rss_reader_example/NewsRss/app/controllers/api/feeds_controller.rb

  def index
    render :json => Feed.all.order(:created_at)
---
SELECT "feeds".* FROM "feeds" ORDER BY "feeds"."created_at" ASC

  def show
    # debugger
    render :json => Feed.find(params[:id]), include: :latest_entries
---
SELECT "entries".* FROM "entries" WHERE "entries"."feed_id" = $1  [["feed_id", 2]]
SELECT "feeds".* FROM "feeds" WHERE "feeds"."id" = $1 LIMIT 1  [["id", "2"]]

  def create
    feed = Feed.find_or_create_by_url(feed_params[:url])
---
INSERT INTO "feeds" ("created_at", "title", "updated_at", "url") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Fri, 07 Aug 2015 00:03:45 UTC +00:00], ["title", "Digital Life : NPR"], ["updated_at", Fri, 07 Aug 2015 00:03:45 UTC +00:00], ["url", "http://www.npr.org/rss/rss.php?id=1049"]]
SELECT "feeds".* FROM "feeds" WHERE "feeds"."url" = 'asdf' LIMIT 1

  def destroy
    Feed.find(params[:id]).destroy
    render :json => Feed.all
---
DELETE FROM "feeds" WHERE "feeds"."id" = $1  [["id", 4]]
SELECT "feeds".* FROM "feeds" WHERE "feeds"."id" = $1 LIMIT 1  [["id", "4"]]
SELECT "feeds".* FROM "feeds"